Revit 2026 API

# RebarHandlePositionData Methods

---

The RebarHandlePositionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
|  | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetNumberOfBars | Gets the number of bars currently in the rebar. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetPosition | Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarHandlePositionData Class

Autodesk.Revit.DB.Structure Namespace